
#запрашиваем значение треугольник

puts "Определить первую сторону"
a = gets.chomp.to_i

puts "Определить вторую сторону"
b = gets.chomp.to_i

puts "Определить третью сторону"
c = gets.chomp.to_i

if a == b && b == c 
  puts "Треугольник равнобедренный и равносторонний"

elsif
a ** 2 == ( b ** 2 + c ** 2) || b ** 2 == ( c ** 2 + a ** 2) || c ** 2 == ( b ** 2 + a ** 2)
puts "Треугольник прямоугольный"

elsif
a == b || b == c || c == a
puts "Треугольник равнобедренный"

else "Разносторонний треугольник"

end

